projects/russian-transit/src/cfe/Русский_Транзит/Catalogs/ГруппыКодовУКТЗЕД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ГруппыКодовУКТЗЕД</Name>
			<Comment>Вспомогательный справочник для оптимизации алгоритмов заполнения цен</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СоставГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьРежимыОформления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьЦеновыеГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимыОфомленияСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеновыеГруппыСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляОтчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокКодов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодУКТЗЕД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторУКТВЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеРежимыОформления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РежимОформления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РежимыОформления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЦеновыеГруппыМашин</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеноваяГруппаМашины</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппыМашин</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/Catalogs/ГруппыКодовУКТЗЕД/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Если НЕ ПометкаУдаления Тогда
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ ПЕРВЫЕ 1
	//		//|	ГруппыКодовУКТЗЕДСписокКодов.Код КАК КодУКТЗЕД,
	//		|	ГруппыКодовУКТЗЕДСписокКодов.Код.Код КАК Код,
	//		|	ГруппыКодовУКТЗЕДСписокКодов.Ссылка КАК Ссылка
	//		|ИЗ
	//		|	Справочник.ГруппыКодовУКТЗЕД.СписокКодов КАК ГруппыКодовУКТЗЕДСписокКодов
	//		|ГДЕ
	//		|	ГруппыКодовУКТЗЕДСписокКодов.Ссылка <> &Ссылка
	//		|	И ГруппыКодовУКТЗЕДСписокКодов.Код <> ЗНАЧЕНИЕ(Справочник.КлассификаторУКТВЭД.ПустаяСсылка)
	//		|	И ГруппыКодовУКТЗЕДСписокКодов.Код В(&МассивКодов)
	//		|	И НЕ ГруппыКодовУКТЗЕДСписокКодов.Ссылка.ПометкаУдаления";
	//	
	//	Запрос.УстановитьПараметр("МассивКодов", СписокКодов.Выгрузить().ВыгрузитьКолонку("Код"));
	//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//			
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Если Выборка.Следующий() Тогда
	//		Сообщить("Код УКТЗЕД " + СокрЛП(Выборка.Код) + " уже используется в группе кодов " + СокрЛП(Выборка.Ссылка));
	//		Отказ = Истина;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	пСоставГруппы = "";
	Для каждого Стр Из СписокКодов Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.Код) Тогда
			Продолжить;
		КонецЕсли;
		
		пСоставГруппы = пСоставГруппы + СокрЛП(Стр.Код.Код) + ", ";
		
	КонецЦикла;
	
	Если пСоставГруппы <> "" Тогда
		пСоставГруппы = Лев(пСоставГруппы, СтрДлина(пСоставГруппы)-2);
	КонецЕсли;
	
	//Если СтрДлина(пСоставГруппы) > 1000 Тогда
	//	пСоставГруппы = Лев(пСоставГруппы, 997) + "...";
	//КонецЕсли;
	
	Если пСоставГруппы <> СоставГруппы Тогда
		СоставГруппы = пСоставГруппы;
	КонецЕсли;
	
	
	пРежимыОфомленияСтрокой = "";
	Если УчитыватьРежимыОформления Тогда
		Для каждого СтрРО Из ДоступныеРежимыОформления Цикл
			
			пРежимыОфомленияСтрокой = пРежимыОфомленияСтрокой + СокрЛП(СтрРО.РежимОформления) + ", ";
			
		КонецЦикла;
		
		Если пРежимыОфомленияСтрокой <> "" Тогда
			пРежимыОфомленияСтрокой = Лев(пРежимыОфомленияСтрокой, СтрДлина(пРежимыОфомленияСтрокой)-2);
		КонецЕсли;
	КонецЕсли;
	
	Если пРежимыОфомленияСтрокой <> РежимыОфомленияСтрокой Тогда
		РежимыОфомленияСтрокой = пРежимыОфомленияСтрокой;
	КонецЕсли;
	
	
	пЦеновыеГруппыСтрокой = "";
	Если УчитыватьЦеновыеГруппы Тогда
		Для каждого СтрЦ Из ЦеновыеГруппыМашин Цикл
			
			пЦеновыеГруппыСтрокой = пЦеновыеГруппыСтрокой + СокрЛП(СтрЦ.ЦеноваяГруппаМашины) + ", ";
			
		КонецЦикла;
		
		Если пЦеновыеГруппыСтрокой <> "" Тогда
			пЦеновыеГруппыСтрокой = Лев(пЦеновыеГруппыСтрокой, СтрДлина(пЦеновыеГруппыСтрокой)-2);
		КонецЕсли;
	КонецЕсли;
	
	Если пЦеновыеГруппыСтрокой <> ЦеновыеГруппыСтрокой Тогда
		ЦеновыеГруппыСтрокой = пЦеновыеГруппыСтрокой;
	КонецЕсли;
	
КонецПроцедуры
